In [11]:
import pandas as pd
a1 = ['phol','IT',100]
a2 = ['saf','game',200]
a3 = ['boy','home',300]
dataa = list(zip(a1, a2, a3))

b1 = ['phol','saf','boy']
b2 = ['IT','game','home']
b3 = [100,200,300]
datab = list(zip(b1, b2, b3))
dataa

[('phol', 'saf', 'boy'), ('IT', 'game', 'home'), (100, 200, 300)]

In [10]:
cols = ['name','item','price']
#รูปแบบที่ 1 ลายนอนเป็นแนวตั้ง
df = pd.DataFrame(dataa,columns=cols)

#รูปแบบที่ 2 ลายนอนเป็นแนวนอน
df2 = pd.DataFrame(datab,columns=cols)

In [8]:
df

   name  item price
0  phol   saf   boy
1    IT  game  home
2   100   200   300

In [9]:
df2

   name  item  price
0  phol    IT    100
1   saf  game    200
2   boy  home    300